# Задача №2.
# Написать точно такую же процедуру, но в декларативном стиле
numbers = [1, 2, 0, 4, 5, 3, 6, 8, 7, 9]

print(sorted(numbers, reverse=True))
